# Задача 1.

print ('Введите трехзначное число: ')
x = int (input())
c = x % 10
b = x // 10 % 10
a = x // 100 % 10
print (a, ' + ', b, ' + ', c, ' = ', a + b + c)
